#ЗАДАЧА 1
#прогноз
w=5
x=0.97
p = w*x
print(p)

#помилка
y=8.7
pl=(p-y)**2
print(pl)

#крутизна
k = 2*(p - y)*x
print(k)

#w_нове
w_нове = 5 - 0.1 * k
print(w_нове)
#4
w=5.7469
x=0.97
p = w*x
print(p)

y=8.7
pl=(p-y)**2
print(pl)

#стало краще: було 14.8225 , стало 9.7688


#ЗАДАЧА 2
#Fiat 128
w = 5
y = 8.1
x = 0.85
k = 2 * (w * x - y) * x
print(k)


w = 9
y = 8.1
x = 0.85
k = 2 * (w * x - y) * x
print(k)

#Pontiac Catalina
w = 5
x = 2.01
y = 16.8
k = 2 * (w * x - y) * x
print(k)

w = 9
y = 16.8
x = 2.01
k = 2 * (w * x - y) * x
print(k)

# ЗАДАЧА 3

w = 12
lr = 1

pl = (w - 8)**2
k = 2 * (w - 8)

print("Початкова помилка:", pl)
print("Крутизна:", k)

w_new = w - lr * k

print("Нове w:", w_new)

pl_new = (w_new - 8)**2

print("Нова помилка:", pl_new)
#Висновок: при lr = 1 помилка не зменшується, а залишається 16. Модель перескакує через правильне значення w = 8.

# ЗАДАЧА 4

x = 1
y = 6
w1 = 2
w2 = 2

# Прямий прохід
h = x * w1
p = h * w2
pl = (p - y)**2

print("h =", h)
print("Прогноз =", p)
print("Помилка =", pl)

# Зворотний прохід
k_p = 2 * (p - y)
k_w2 = k_p * h
k_h = k_p * w2
k_w1 = k_h * x

print("Крутизна прогнозу =", k_p)
print("Крутизна w2 =", k_w2)
print("Крутизна h =", k_h)
print("Крутизна w1 =", k_w1)

# Один крок навчання
lr = 0.05

w1_new = w1 - lr * k_w1
w2_new = w2 - lr * k_w2

print("Нове w1 =", w1_new)
print("Нове w2 =", w2_new)

# Нова помилка
h_new = x * w1_new
p_new = h_new * w2_new
pl_new = (p_new - y)**2

print("Новий прогноз =", p_new)
print("Нова помилка =", pl_new)
#Висновок: після одного кроку навчання з lr = 0.05 помилка зменшилася з 4 до 0.0576. Це означає, що нейромережа стала точнішою.



#Задача 5
# ЗАДАЧА 5*

x = 1
y = 6
w1 = 0
w2 = 0

# Прямий прохід
h = x * w1
p = h * w2
pl = (p - y)**2

print("h =", h)
print("Прогноз =", p)
print("Помилка =", pl)

# Зворотний прохід
k_p = 2 * (p - y)
k_w2 = k_p * h
k_h = k_p * w2
k_w1 = k_h * x

print("Крутизна w2 =", k_w2)
print("Крутизна w1 =", k_w1)
#Якщо початкові ваги нейромережі дорівнюють нулю, то обидві крутизни також дорівнюють нулю. Навчання не відбувається, оскільки ваги не змінюються. Ваги нейромережі заповнюють випадковими числами, щоб нейрони могли навчатися по-різному та знаходити правильні значення.

